package com.telegramBot.nutricion.dictionaries;

public interface TextNormalConstipation {

    String DESCRIPTION_FOURTH =
            """
            %s
            📌 Каждый прием пищи должен укладываться в разовый объем: %.0f мл
            
            🥦 При склонности к запорам, первым продуктом ребенку следует предложить овощные пюре. Продукт вводится постепенно с  увеличением объема (10 мл ➡️150 мл) в течении 7 дней.
            Важно начинать с пюре из одного вида овощей, следующий вид вводится только после того, как пюре из первого овоща достигло объема 75 мл
            Рекомендуемые овощи: брокколи, тыква, цветная капуста.

            ️ ️️️❗️ *Обратитесь с этой жалобой к педиатру, возможно, необходимо дообследование*
            
            💧 В течении дня очень важно давать ребенку воду. В объеме одного кормления, разделив его в течении дня.
            """;

    String MENU_FOURTH =
            """
            📖 Пример меню 1 неделя:
            7:00 – ГМ/АМС %.0f мл
            11:00 – Овощное пюре 10 мл
                    ГМ/АМС %.0f мл
                    Вода %.0f мл
            15:00 – ГМ/АМС %.0f мл
                    Вода %.0f мл
            19:00 – ГМ/АМС %.0f мл
            23:00 – ГМ/АМС %.0f мл
                    Вода %.0f мл
            🌙 Ночное кормление
                    
            2–4 недели:
            7:00 – ГМ/АМС %.0f мл
            11:00 – Овощное пюре 75 мл
                    ГМ/АМС %.0f мл
            15:00 – ГМ/АМС %.0f мл
            19:00 – ГМ/АМС %.0f мл
            23:00 – ГМ/АМС %.0f мл
            🌙 Ночное кормление
            
            *ГМ – грудное молоко
            *АМС – адаптированная молочная смесь
            """;

    String DESCRIPTION_FIFTH =
            """
            %s
            
            ️️❗️ *При запорах обратитесь к педиатру, возможно, необходимо дообследование*
            
            📌 Каждый прием пищи должен укладываться в разовый объем: %.0f мл
            
            Продукты следует вводить в рацион последовательно, внимательно отслеживая реакцию ребенка на каждый продукт.
            
            1 неделя 🥣
            Ребенку следует предложить  монозлаковые безмолочные каши, разведенные на грудном молоке или адаптированной молочной смеси, достигая максимального суточного объема (10 мл ➡️ 150 мл) в течении 5–7 дней. 
            + Добавляем в кашу сливочное масло (1г ➡️ 3г)
            + Добавляем растительное масло к овощному пюре (1г ➡️ 3г)
            
            2 неделя 🍏
            Вводятся фруктовые пюре (5 мл ➡️ 50 мл в течении 7 дней). Важно начинать с пюре из одного вида фруктов, следующий вид вводится только после того, как пюре из первого фрукта достигло объема 25 мл 
            Предпочтительно фруктовое пюре из чернослива, слив,  яблок.
            
            💧 В течении дня очень важно давать ребенку воду. В объеме разового приема пищи, разделив его в течении дня.
            """;

    String MENU_FIFTH =
            """
            📖 Пример меню 1 неделя:
            7:00 – ГМ/АМС %.0f мл
            11:00 – Безмолочная каша 10 мл
                    Сливочное масло 0,5 г
                    ГМ/АМС %.0f мл
            15:00 – Овощное пюре 75 мл
                    Растительное масло 1 мл
                    ГМ/АМС %.0f мл
            19:00 – ГМ/АМС %.0f мл
            23:00 – Овощное пюре 75 мл
                    Растительное масло 1 мл
                    ГМ/АМС %.0f мл
            🌙 Ночное кормление
                    
            2 неделя:
            7:00 – ГМ/АМС %.0f мл
            11:00 – Безмолочная каша 75 мл
                    Фруктовое пюре 5 мл
                    Сливочное масло 1,5 г
                    ГМ/АМС %.0f мл
            15:00 – Овощное пюре 75 мл
                    Растительное масло 1,5 мл
                    ГМ/АМС %.0f мл
            19:00 – Безмолочная каша 75 г
                    Сливочное масло 1,5 г
                    ГМ/АМС %.0f мл
            23:00 – Овощное пюре 75 мл
                    Растительное масло 1,5 мл
                    ГМ/АМС %.0f мл
            🌙 Ночное кормление
            
            3,4 недели:
            7:00 – ГМ/АМС %.0f мл
            11:00 – Безмолочная каша 75 мл
                    Фруктовое пюре 25 мл
                    Сливочное масло 1,5 г
                    ГМ/АМС %.0f мл
            15:00 – Овощное пюре 75 мл
                    Растительное масло 1,5 мл
                    ГМ/АМС %.0f мл
            19:00 – Безмолочная каша 75 г
                    Сливочное масло 1,5 г
                    Фруктовое пюре 25 мл
                    ГМ/АМС %.0f мл
            23:00 – Овощное пюре 75 мл
                    Растительное масло 1,5 мл
                    ГМ/АМС %.0f мл
            🌙 Ночное кормление
            
            *ГМ – грудное молоко
            *АМС – адаптированная молочная смесь
            """;

    String DESCRIPTION_SIXTH =
            """
            %s
            
            ️❗️ *При запорах обратитесь к педиатру, возможно, необходимо дообследование*
            
            📌 Каждый прием пищи должен укладываться разовый объем: %.0f мл
            
            Обратите внимание на продукты, которые должны были быть введены ранее (раздел «Календарь и правила введения прикорма» –> Суточный объем прикормов).
            
            🥩 На 1 неделе вводим мясное пюре. Продукт вводится постепенно с  увеличением объема (5 мл –> 30 мл) в течении 5–7 дней.
            Либо отварное мясо (3 мл –> 15 мл)
            
            💧В течении дня очень важно давать ребенку воду. В объеме разового приема пищи, разделив его в течении дня.
            """;

    String MENU_SIXTH =
            """
            📖Пример меню:
            
            1 неделя :
            7:00 – АМС/ГМ %.0f мл
            11:00 – Безмолочная каша 100 мл
                    Масло сливочное 2 г
                    Фруктовое пюре 20 мл
                    АМС/ГМ %.0f мл
            15:00 – Овощное пюре 95 мл
                    Масло растительное 2 мл
                    Мясное пюре 5 мл
                    АМС/ГМ %.0f мл
            19:00 – Фруктовое пюре 40 мл
                    Безмолочная каша 50 мл
                    Сливочное масло 2 г
                    АМС/ГМ %.0f мл
            23:00 – АМС/ГМ %.0f мл
            🌙 Ночное кормление
                    
            2–4 недели:
            7:00 – АМС/ГМ %.0f мл
            11:00 – Безмолочная каша 80 мл
                    Масло сливочное 2 г
                    Фруктовое пюре 40 мл
                    АМС/ГМ %.0f мл
            15:00 – Овощное пюре 90 мл
                    Мясное пюре 30 мл
                    Растительное масло 5 мл
                    АМС/ГМ %.0f мл
            19:00 – Безмолочная каша 80 мл
                    Сливочное масло 2 г
                    Фруктовое пюре 30 мл
                    АМС/ГМ %.0f мл
            23:00 – АМС/ГМ %.0f мл
            🌙 Ночное кормление
            *ГМ – грудное молоко
            *АМС – адаптированная молочная смесь
            """;

    String DESCRIPTION_SEVENTH =
            """
            %s
            
            ️❗️ *При запорах обратитесь к педиатру, возможно, необходимо дообследование*
            
            📌 Каждый прием пищи должен укладываться в разовый объем: %.0f мл
            
            🥚 Вводим отварной яичный желток. 1/4 желтка, добавляем в кашу.
            
            💧В течении дня очень важно давать ребенку воду. В объеме разового приема пищи, разделив его в течении дня
            
            Обратите внимание на продукты, которые уже должны были быть введены ранее (раздел «Календарь и правила введения прикорма»).
            """;

    String MENU_SEVENTH =
            """
            📖Пример меню:
            7:00 – ГМ/АМС %.0f мл
            11:00 – Безмолочная каша, разведенная водой 75 мл
                    Желток вареного куриного яйца ¼ (добавить в кашу)
                    Фруктовое пюре 60 мл
                    ГМ/АМС %.0f мл
            15:00 – Овощное пюре 70 мл
                    Растительное масло 3 мл
                    Мясное пюре 50 мл
                    ГМ/АМС %.0f мл
            19:00 – Овощное пюре 80 мл
                    Растительное масло 2 мл
                    ГМ/АМС %.0f мл
            23:00 – АМС/ГМ %.0f мл
            🌙 Ночное кормление
            
            *ГМ – грудное молоко
            *АМС – адаптированная молочная смесь
            """;

    String DESCRIPTION_EIGHTH =
            """
            %s
            
            ️❗️ *При запорах обратитесь к педиатру, возможно, необходимо дообследование*
            
            📌 Каждый прием пищи должен укладываться в разовый объем: %.0f мл
            
            Обратите внимание на продукты, которые должны были быть введены ранее (раздел «Календарь и правила введения прикорма»).
            Прикормы следует вводить в рацион последовательно, внимательно отслеживая реакцию ребенка на каждый продукт.
            
            1 неделя 🥛
            Ребенку следует предложить кисломолочные продукты (творожки, кефир), достигая максимального суточного объема (творог: 10 мл ➡️ 40 мл, кефир: 200 мл) в течении 5–7 дней.
            
            2 неделя 🐟
            Вводится рыбное пюре. Продукт вводится также постепенно с  увеличением объема (5 мл ➡️ 30 мл) в течении 7 дней. Давать не реже 2 раз в неделю, заменяя мясного пюре.
            
            3 неделя 🍞
            Необходимо ввести в рацион хлебобулочные изделия: хлеб пшеничный/сухари/детское печенье 5 г. (1 шт.)
            
            💧 В течении дня очень важно давать ребенку воду. В объеме разового приема пищи, разделив его в течении дня
            """;

    String MENU_EIGHTH =
            """
            📖 Пример меню:
            
            1 неделя:
            7:00  – ГМ/АМС %.0f мл
            11:00 – Творог 10 мл
                    Фруктовое пюре 80 мл
                    ГМ/АМС %.0f мл
            15:00 – Безмолочная каша 130 мл
                    Сливочное масло 5 г.
                    Желток вареного куриного яйца 1/2 (добавить в кашу)
                    ГМ/АМС %.0f мл
            19:00 – Овощное пюре 64 мл
                    Растительное масло 6 мл
                    Мясное пюре 70 мл
                    ГМ/АМС %.0f мл
            23:00 – ГМ/АМС %.0f мл
            🌙 Ночное кормление
            
            2 неделя:
            7:00 – Кефир 70 мл
                   ГМ / АМС %.0f мл
            11:00 – Безмолочная каша 100 мл
                    Сливочное масло 5 г.
                    Желток вареного куриного яйца 1/2 (добавить в кашу)
                    Фруктовое пюре 20 мл
            15:00 – Овощное пюре 150 мл
                    Растительное масло 6 мл
                    Рыбное пюре 5 мл.(вт,чт)/Мясное пюре 5 мл.(пн,ср,пт)
                    Кефир 60 мл
            19:00 – Творог 40 мл
                    Фруктовое пюре 50 мл
                    ГМ/АМС %.0f мл
            23:00 – Кефир 70 мл мл
                    ГМ / АМС %.0f мл
            🌙 Ночное кормление
            
            3 неделя:
            7:00 – ГМ/АМС %.0f
            11:00 – Безмолочная каша 100 мл
                    Сливочное масло 5 г.
                    Желток вареного куриного яйца 1/2 (добавить в кашу)
                    Фруктовое пюре 20 мл
                    Детское печенье 5 г
                    ГМ/АМС %.0f мл
            15:00 – Овощное пюре 100 мл
                    Растительное масло 6 мл
                    Рыбное пюре 30 мл.(вт,чт)/Мясное пюре 30 мл.(пн,ср,пт)
                    Кефир 64 мл
            19:00 – Творог 40 мл
                    Фруктовое пюре 50 мл
                    ГМ/АМС %.0f мл
            23:00 – Кефир  140 мл
                    ГМ/АМС %.0f мл
            🌙 Ночное кормление
                    
            4 неделя:
            7:00 – ГМ/АМС %.0f
            11:00 – Безмолочная каша 90 мл
                    Сливочное масло 5 г
                    Желток вареного куриного яйца 1/2 (добавить в кашу)
                    Фруктовое пюре 30 мл
                    ГМ/АМС %.0f мл
            15:00 – Овощное пюре 100 мл
                    Растительное масло 6 мл
                    Рыбное пюре 30 мл.(вт,чт)/Мясное пюре 30 мл.(пн,ср,пт)
                    Кефир 64 мл
            19:00 – Творог 40 мл
                    Фруктовое пюре 50 мл
                    Детское печенье 5 г
                    ГМ/АМС %.0f мл
            23:00 – Кефир 100 мл
                    ГМ/АМС %.0f мл
            🌙 Ночное кормление
            *ГМ – грудное молоко
            *АМС – адаптированная молочная смесь
            """;

    String DESCRIPTION_NINTH_TO_TWELFTH =
            """
             %s
             
             ️❗️ *При запорах обратитесь к педиатру, возможно, необходимо дообследование*
             
             📌 Каждый прием пищи, должен укладываться в разовый объем: %.0f мл
             
             В этом возрасте должна меняться консистенция продуктов от гомогенизированной переходим к мелко– и крупноизмельченной
             
             🧃 Все прикормы введены, можно добавить детские соки с мякотью, промышленного производства! Не более 80–100 мл в день.
             
             💧 В течении дня очень важно давать ребенку воду. В объеме разового приема пищи, разделив его в течении дня
             
             Обратите внимание на продукты, которые должны были быть введены ранее (раздел «Календарь и правила введения прикорма»).
             """;

    String MENU_NINTH_TO_TWELFTH =
            """
             📖 Пример меню :
             7:00 – ГМ / АМС %.0f мл
             11:00 – Безмолочная каша 100 мл
                     Сливочное масло 5 г.
                     Желток вареного куриного яйца 1/2 (добавить в кашу)
                     Фруктовое пюре 20 мл
                     ГМ/АМС %.0f мл
             15:00 – Овощное пюре 100 мл
                     Растительное масло 6 мл
                     Рыбное пюре 30 мл.(вт,чт)/Мясное пюре 30 мл.(пн,ср,пт)
                     Кефир 64 мл
             19:00 – Творог 50 мл
                     Фруктовое пюре 60 мл
                     Детское печенье 5 г
                     Сок с мякотью 85 мл
             23:00 – Кефир 100 мл
                     ГМ/АМС %.0f мл
             🌙 Ночное кормление
             *ГМ – грудное молоко
             *АМС – адаптированная молочная смесь
             """;
}
